blog/posts/Things-I-Like-about-GO-Language.org
#+BLOG: eissanematollahi
#+POSTID: 108
#+ORG2BLOG:
#+DATE: [2018-06-29]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil ':t
#+CATEGORY: Software
#+TAGS: C++, Composition, Go, Inheritance, Interface, Java, Object-oriented design
#+DESCRIPTION:
#+TITLE: Things I Like about Go Language
#+SUBTITLE: A brief comparison of Go features with those of C++ and Java

I recently had a chance to design and develop a library in Go language, also known as Golang, which has been used by some Kubernetes-based services in Huawei's cloud platform. Having developed several C++ and Java libraries in the past, I have come to admire the simplistic design of Go.

In this blog post, I will share my personal thoughts on the pragmatic approach of Go that I found particularly interesting. For example, Go deliberately forbids inheritance and only allows composition, while Java allows single inheritance and C++ permits multiple. Note that best practices advise using composition over inheritance. It is debatable whether forbidding inheritance is a good thing or not, but composition definitely yields a simpler, highly decoupled, and easily maintainable code than does inheritance.

# I will begin with a brief history of the Go and how it has evolved. Then, I will compare features of Go, C++, and Java to support some programming concepts. The reader is expected to be familiar with basics of object-oriented design -- such as inheritance and encapsulation -- and at least a programming language that supports it. It would also be helpful if the reader has a basic understanding of concurrency.

* History of Go
Go is a modern programming language created at Google by Robert Griesemer, Rob Pike, and Ken Thompson and announced in November 2009. Primary motivation of the authors behind the design of Go was to avoid many design flaws and complexities in C++ while keeping advantages of C and adding advanced features, such as garbage collection, goroutines and channels, and support for object-oriented and functional programming. As Rob Pike once said: "Complexity is multiplicative." Thus, the authors deliberately omitted some features common in similar languages and conservatively included their positive characteristics. The result is a simple yet powerful compiled language (like C/C++) with modern features like package management, garbage collection, and exceptional concurrency support.

Go is influenced by several languages. Its expression syntax and use of pointers and references remind us of C language. However, thanks to its garbage collector, one needs not worry about manual memory managements and nasty memory leaks. Variable declarations and function definitions resemble those of the Pascal language. The concepts of package management and imports are also from languages Modula-2, Oberon, Oberon-2, and Object Oberon, which are developed from Pascal. These languages are well known for their high compilation speed, mostly due to their unique way of dependency management. Powerful concurrency support of Go is built upon the concept of /communicating sequential processes/ (CSP), introduced by Tony Hoare in 1978. The concept of CSP was previously implemented in languages like Squeak, Newsqueak and Alef.

* Concurrency vs. Parallelism
Concurrency and parallelism are terminologies used in multi-threaded systems but refer to different mechanisms. All the following four cases are possible:
+ Neither concurrent nor parallel system
+ Concurrent but not parallel system
+ Parallel but not concurrent system
+ Both concurrent and parallel system
To illustrate what concurrency and parallelism mean, let us consider an example of cars and roads. Imagine cars moving on a road with single lane. Any car can only move when the car in front of it moves forward; otherwise, it's blocked. This is an example of neither concurrent nor parallel system.

Now, suppose that cars from different direction approach an intersection with a stop sign. Only one car at a time can go through the intersection. Thus, cars move concurrently one at a time. This is an example of concurrent but not parallel system.

Next, imagine a highway with multiple lanes in which cars move in their own lane without interfering with those in the other lanes. This is an example of a parallel but not concurrent system.

Finally, imagine the same highway in which cars are trying to merge the highway. The merging cars and those in the far right move concurrently, while those in other lanes move in parallel. This case is an example of both parallel and concurrent system.

** Concurrency
One might think that any code will run faster on machines with more cores. It is true, though, only if the code is designed with supporting concurrency in mind. A code with four concurrent threads will run faster when moved from a single core machine to a quad-core machine. Thus, it is important to design a code with concurrency in mind.

Concurrent programming in Go is modeled as communicating sequential processes (CSP) by means of goroutines and channels. Goroutines are lightwight threads and channels are instruments to send and receive messages among goroutimes. Goroutines and channels are signature features of Go and contributed to its popularity due to their ease of use and efficient implementation.

A goroutine is a function called with the keyword ~go~, which runs in a different thread from the main one. In the following code, ~counter~ runs in the main thread, while ~spinner~ runs in a separate thread.
#+begin_src go
func main() {
	go spinner(100 * time.Millisecond)
    counter(10, 500 * time.Millisecond)
}

func spinner(delay time.Duration) {
	for {
		for _, r := range `-\|/` {
			fmt.Printf("\r%c", r)
			time.Sleep(delay)
		}
	}
}

func counter(n int, delay time.Duration) {
	for i := 1; i <= n; i++ {
		fmt.Printf("\r\t%d", i)
		time.Sleep(delay)
	}
}
#+end_src
Goroutines communicate through channels. Channels are first-class object types in Go. They can be declared, initialized, and passed to functions similar to any other variables. They may be bidirectional, both sender and receiver, or unidirectional, either sender or receiver. Let us illustrate using channels with an example.

