blog/posts/Things-I-Like-about-GO-Language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-02 Mon 03:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Things I Like about Go Language</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Eissa Nematollahi" />
</head>
<body>
<div id="content">
<h1 class="title">Things I Like about Go Language
<br>
<span class="subtitle">A brief comparison of Go features with those of C++ and Java</span>
</h1>
<p>
I recently had a chance to design and develop a library in Go language, also known as Golang, which has been used by some Kubernetes-based services in Huawei&rsquo;s cloud platform. Having developed several C++ and Java libraries in the past, I have come to admire the simplistic design of Go.
</p>

<p>
In this blog post, I will share my personal thoughts on the pragmatic approach of Go that I found particularly interesting. For example, Go deliberately forbids inheritance and only allows composition, while Java allows single inheritance and C++ permits multiple. Note that best practices advise using composition over inheritance. It is debatable whether forbidding inheritance is a good thing or not, but composition definitely yields a simpler, highly decoupled, and easily maintainable code than does inheritance.
</p>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">History of Go</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Go is a modern programming language created at Google by Robert Griesemer, Rob Pike, and Ken Thompson and announced in November 2009. Primary motivation of the authors behind the design of Go was to avoid many design flaws and complexities in C++ while keeping advantages of C and adding advanced features, such as garbage collection, goroutines and channels, and support for object-oriented and functional programming. As Rob Pike once said: &ldquo;Complexity is multiplicative.&rdquo; Thus, the authors deliberately omitted some features common in similar languages and conservatively included their positive characteristics. The result is a simple yet powerful compiled language (like C/C++) with modern features like package management, garbage collection, and exceptional concurrency support.
</p>

<p>
Go is influenced by several languages. Its expression syntax and use of pointers and references remind us of C language. However, thanks to its garbage collector, one needs not worry about manual memory managements and nasty memory leaks. Variable declarations and function definitions resemble those of the Pascal language. The concepts of package management and imports are also from languages Modula-2, Oberon, Oberon-2, and Object Oberon, which are developed from Pascal. These languages are well known for their high compilation speed, mostly due to their unique way of dependency management. Powerful concurrency support of Go is built upon the concept of <i>communicating sequential processes</i> (CSP), introduced by Tony Hoare in 1978. The concept of CSP was previously implemented in languages like Squeak, Newsqueak and Alef.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Concurrency vs. Parallelism</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Concurrency and parallelism are terminologies used in multi-threaded systems but refer to different mechanisms. All the following four cases are possible:
</p>
<ul class="org-ul">
<li>Neither concurrent nor parallel system</li>
<li>Concurrent but not parallel system</li>
<li>Parallel but not concurrent system</li>
<li>Both concurrent and parallel system</li>
</ul>
<p>
To illustrate what concurrency and parallelism mean, let us consider an example of cars and roads. Imagine cars moving on a road with single lane. Any car must wait until the car in front of it moves forward; otherwise, it&rsquo;s blocked. This is an example of neither concurrent nor parallel system.
</p>

<p>
Now, suppose that cars from different direction approach an intersection with a stop sign. Only one car at a time can go through the intersection. Thus, cars move concurrently one at a time. This is an example of concurrent but not parallel system.
</p>

<p>
Next, imagine a highway with multiple lanes in which cars move in their own lane without interfering with those in the other lanes. This is an example of a parallel but not concurrent system.
</p>

<p>
Finally, imagine the same highway in which cars are trying to merge the highway. The merging cars and those in the far right move concurrently, while those in other lanes move in parallel. This case is an example of both parallel and concurrent system.
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Concurrency</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
One might think that any code will run faster on machines with more cores. It is true, though, only if the code is designed with supporting concurrency in mind. A code with four concurrent threads will run faster when moved from a single core machine to a quad-core machine. Thus, it is important to design a code with concurrency in mind.
</p>

<p>
Concurrent programming in Go is modeled as communicating sequential processes (CSP) by means of goroutines and channels. Goroutines are lightwight threads and channels are instruments to send and receive messages among goroutimes. Goroutines and channels are signature features of Go and contributed to its popularity due to their ease of use and efficient implementation.
</p>

<p>
A goroutine is a function called with the keyword <code>go</code>, which runs in a different thread from the main one. In the following code, <code>counter</code> runs in the main thread, while <code>spinner</code> runs in a separate thread.
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">main</span>() {
    <span style="color: #ffb6c1; font-size: 105%;">go</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">spinner</span>(100 * time.Millisecond)
    <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">counter</span>(10, 500 * time.Millisecond)
}

<span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">spinner</span>(delay <span style="color: #ffff00; font-size: 105%;">time.Duration</span>) {
    <span style="color: #ffb6c1; font-size: 105%;">for</span> {
        <span style="color: #ffb6c1; font-size: 105%;">for</span> _, r := <span style="color: #ffb6c1; font-size: 105%;">range</span> <span style="color: #ffa07a;">`-\|/`</span> {
            fmt.<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Printf</span>(<span style="color: #ffa07a;">"\r%c"</span>, r)
            time.<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Sleep</span>(delay)
        }
    }
}

<span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">counter</span>(n <span style="color: #ffff00; font-size: 105%;">int</span>, delay <span style="color: #ffff00; font-size: 105%;">time.Duration</span>) {
    <span style="color: #ffb6c1; font-size: 105%;">for</span> i := 1; i &lt;= n; i++ {
        fmt.<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Printf</span>(<span style="color: #ffa07a;">"\r\t%d"</span>, i)
        time.<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Sleep</span>(delay)
    }
}
</pre>
</div>
<p>
Goroutines communicate through channels. Channels are first-class object types in Go. They can be declared, initialized, and passed to functions similar to any other variables. They may be bidirectional, both sender and receiver, or unidirectional, either sender or receiver. Let us illustrate using channels with an example.
</p>
</div>
</div>
