blog/posts/Things-I-Like-about-GO-Language.org
** Example
Suppose that we want to compute \(\sum_{i=1}^nf(x_i)\), where computation of \(f(x_i)\) values are expensive, but can be done in parallel. We will see in a moment how easy it is to design a concurrent code for this problem.

We design \(n\) goroutines each responsible for computing one function value and sending it to a channel. Then the main goroutine receives from the channel and adds them up to compute the total summation.

#+begin_src go
func SumSerial(x []int, f func(int) int) int {
	sum := 0
	for _, xi := range x {
		sum += f(xi)
	}
	return sum
}

func SumParallel(x []int, f func(int) int) int {
	entries := make(chan int)
	for _, xi := range x {
		go func(val int) {
			entries <-f(val)
		}(xi)
	}
	sum := 0
	for range x {
		sum += <-entries
	}
	return sum
}
#+end_src
In function ~SumConcurrent~, we create \(n\) goroutines, each responsible for computing one function value and sending the result to ~entries~ channel. The main goroutine receives from the channel and add up the values.

Note that ~xi~ is not used directly in the goroutines inside the loop. Instead, we pass it as an argument to the goroutines. The reason is that we do not want a variable to be shared among all goroutines.

* Inheritance vs. Composition
It's widely accepted that composition should be preferred over inheritance. Rule 34 from [[http://www.gotw.ca/publications/c++cs.htm][/C++ Coding Standards/]] by Herb Sutter and Andrei Alexandrescu recommends to:
#+begin_quote
Avoid inheritance taxes: Inheritance is the second-tightest coupling relationship in C++, second only to friendship. Tight coupling is undesirable and should be avoided where possible.
#+end_quote
C++ allows multiple inheritance, which is advised to be used judiciously, since it may yield ambiguities and complexities like the /diamond problem/; see Item 40 of [[http://www.aristeia.com/books.html][Effective C++]] by Scott Meyers.

To avoid such ambiguities and complexities, Java only allows single inheritance, sacrificing minor benefits of the multiple inheritance. Such a limitation is a good feature as it yields less complicated design and more manageable code. Even the use of single inheritance is advised to be restricted for merely type definitions; consult Item 16 of [[https://www.safaribooksonline.com/library/view/effective-java-2nd/9780137150021/][Effective Java™]] by Joshua Bloch.

Considering all such issues with inheritance, Go delibrately forbids inheritance. Does this mean Go limits capabilities of the developer? Not really! All the benefits of inheritance can be attained, without any sacrifices, by means of composition and the the empty interface in Go.

Using composition is C++ and Java is cumbersome, since all required methods of a class must be forwarded. Go, however, automates this process for developers through the /struct embedding/ mechanism, described in Section 6.3 of [[https://dl.acm.org/citation.cfm?id=2851099][The Go Programming Language]], by Alan A.A. Donovan	and Brian W. Kernighan. Embedding is carried out by including an anonymous struct into another. In the following code snippet, struct Point is embedded in struct Circle:
#+begin_src go
type Point struct {
    X, Y float64
}

type Circle struct {
    Point  // embedded
    Radius float64
}

var c Circle
c.X = 1 // implicit access: X is forwarded from Point to Circle
c.Point.Y = 2 // explicit access
#+end_src
Fields of the embedded struct Point can be both explicitly and implicitly accessed by the Circle instances. In explicit access, the type name (Point) is used as an instance name.

Note that composition can be done without embedding. In this case, the fields of the composed struct are not promoted to the including struct. In the following example, Point is composed in Circle without embedding:
#+begin_src go
type Circle struct {
    Center Point
    Radius float64
}

var c Circle
c.Center.X = 1
c.Center.Y = 2
#+end_src

* Fast Compilation
Go is a compiled language, and its compilation is notably faster than most other compiled languages, like C and C++. Fast compilation was one of the main considerations in the design of GO. The main reason for its compilation speed may be because of its unique way of managing dependencies. As previously mentioned, Go has borrowed design ideas for its package management from Pascal and its successors, which are well known for their lightening fast compilers. Beside better dependency management, the following features, or lack of features, also contribute to its fast compilation:
1) Imports must be included explicitly at the top of each source file.
2) Unused imports, like unused variables, cause compilation errors. This seemingly annoying feature contributes to the fast compilation of source codes.
3) Dependencies constitute a directed acyclic graph (DAG). Thus, packages can be compiled separately and perhaps in parallel.
4) A compiled Go package stores not only its exported symbols and information, but also those of its dependent packages.
5) Go's simplicity and lack of some features, like inheritance and function overloads, also contribute to its high compilation speed.

