blog/posts/Things-I-Like-about-GO-Language.html

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Example</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
Suppose that we want to compute \[\sum_{i=1}^nf(x_i)!\], where computation of \(f(x_i)\) values are expensive, but can be done in parallel. We will see in a moment how easy it is to design a concurrent code for this problem.
</p>

<p>
We design \(n\) goroutines each responsible for computing one function value and sending it to a channel. Then the main goroutine receives from the channel and adds them up to compute the total summation.
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">SumSerial</span>(x []<span style="color: #ffff00; font-size: 105%;">int</span>, f <span style="color: #ffb6c1; font-size: 105%;">func</span>(<span style="color: #ffff00; font-size: 105%;">int</span>) <span style="color: #ffff00; font-size: 105%;">int</span>) <span style="color: #ffff00; font-size: 105%;">int</span> {
    sum := 0
    <span style="color: #ffb6c1; font-size: 105%;">for</span> _, xi := <span style="color: #ffb6c1; font-size: 105%;">range</span> x {
        sum += <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">f</span>(xi)
    }
    <span style="color: #ffb6c1; font-size: 105%;">return</span> sum
}

<span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">SumParallel</span>(x []<span style="color: #ffff00; font-size: 105%;">int</span>, f <span style="color: #ffb6c1; font-size: 105%;">func</span>(<span style="color: #ffff00; font-size: 105%;">int</span>) <span style="color: #ffff00; font-size: 105%;">int</span>) <span style="color: #ffff00; font-size: 105%;">int</span> {
    entries := <span style="color: #87cefa; text-decoration: underline;">make</span>(<span style="color: #ffb6c1; font-size: 105%;">chan</span> <span style="color: #ffff00; font-size: 105%;">int</span>)
    <span style="color: #ffb6c1; font-size: 105%;">for</span> _, xi := <span style="color: #ffb6c1; font-size: 105%;">range</span> x {
        <span style="color: #ffb6c1; font-size: 105%;">go</span> <span style="color: #ffb6c1; font-size: 105%;">func</span>(val <span style="color: #ffff00; font-size: 105%;">int</span>) {
            entries &lt;-<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">f</span>(val)
        }(xi)
    }
    sum := 0
    <span style="color: #ffb6c1; font-size: 105%;">for</span> <span style="color: #ffb6c1; font-size: 105%;">range</span> x {
        sum += &lt;-entries
    }
    <span style="color: #ffb6c1; font-size: 105%;">return</span> sum
}
</pre>
</div>
<p>
In function <code>Sum</code>, we create \(n\) goroutines, each responsible for computing one function value and sending the result to <code>entries</code> channel. The main goroutines receives from the channel and sums them up.
</p>

<p>
Note that <code>xi</code> is not used directly in the goroutines inside the loop. Instead, we pass it as argument to the goroutines. The reason is that we do not want all goroutines share variables.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Inheritance vs. Composition</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
It&rsquo;s widely accepted that composition should be preferred over inheritance. Rule 34 from <a href="http://www.gotw.ca/publications/c++cs.htm"><i>C++ Coding Standards</i></a> by Herb Sutter and Andrei Alexandrescu recommends to:
</p>
<blockquote>
<p>
Avoid inheritance taxes: Inheritance is the second-tightest coupling relationship in C++, second only to friendship. Tight coupling is undesirable and should be avoided where possible.
</p>
</blockquote>
<p>
C++ allows multiple inheritance, which is advised to be used judiciously, since it may yield ambiguities and complexities like the <i>diamond problem</i>; see Item 40 of <a href="http://www.aristeia.com/books.html">Effective C++</a> by Scott Meyers.
</p>

<p>
To avoid such ambiguities and complexities, Java only allows single inheritance, sacrificing minor benefits of the multiple inheritance. Such a limitation is a good feature as it yields less complicated design and more manageable code. Even the use of single inheritance is advised to be restricted for merely type definitions; consult Item 16 of <a href="https://www.safaribooksonline.com/library/view/effective-java-2nd/9780137150021/">Effective Java™</a> by Joshua Bloch.
</p>

<p>
Considering all such issues with inheritance, Go delibrately forbids inheritance. Does this mean Go limits capabilities of the developer? Not really! All the benefits of inheritance can be attained, without any sacrifices, by means of composition and the the empty interface in Go.
</p>

<p>
Using composition is C++ and Java is cumbersome, since all required methods of a class must be forwarded. Go, however, automates this process for developers through the <i>struct embedding</i> mechanism, described in Section 6.3 of <a href="https://dl.acm.org/citation.cfm?id=2851099">The Go Programming Language</a>, by Alan A.A. Donovan    and Brian W. Kernighan. Embedding is carried out by including an anonymous struct into another. In the following code snippet, struct Point is embedded in struct Circle:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">type</span> <span style="color: #ffff00; font-size: 105%;">Point</span> <span style="color: #ffb6c1; font-size: 105%;">struct</span> {
    X, Y float64
}

<span style="color: #ffb6c1; font-size: 105%;">type</span> <span style="color: #ffff00; font-size: 105%;">Circle</span> <span style="color: #ffb6c1; font-size: 105%;">struct</span> {
    Point  <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">embedded</span>
    Radius float64
}

<span style="color: #ffb6c1; font-size: 105%;">var</span> c Circle
c.X = 1 <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">implicit access: X is forwarded from Point to Circle</span>
c.Point.Y = 2 <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">explicit access</span>
</pre>
</div>
<p>
Fields of the embedded struct Point can be both explicitly and implicitly accessed by the Circle instances. In explicit access, the type name (Point) is used as an instance name.
</p>

<p>
Note that composition can be done without embedding. In this case, the fields of the composed struct are not promoted to the including struct. In the following example, Point is composed in Circle without embedding:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">type</span> <span style="color: #ffff00; font-size: 105%;">Circle</span> <span style="color: #ffb6c1; font-size: 105%;">struct</span> {
    Center Point
    Radius float64
}

<span style="color: #ffb6c1; font-size: 105%;">var</span> c Circle
c.Center.X = 1
c.Center.Y = 2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Fast Compilation</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
Go is a compiled language, and its compilation is notably faster than most other compiled languages, like C and C++. Fast compilation was one of the main considerations in the design of GO. The main reason for its compilation speed may be because of its unique way of managing dependencies. As previously mentioned, Go has borrowed design ideas for its package management from Pascal and its successors, which are well known for their lightening fast compilers. Beside better dependency management, the following features, or lack of features, also contribute to its fast compilation:
</p>
<ol class="org-ol">
<li>Imports must be included explicitly at the top of each source file.</li>
<li>Unused imports, like unused variables, cause compilation errors. This seemingly annoying feature contributes to the fast compilation of source codes.</li>
<li>Dependencies constitute a directed acyclic graph (DAG). Thus, packages can be compiled separately and perhaps in parallel.</li>
<li>A compiled Go package stores not only its exported symbols and information, but also those of its dependent packages.</li>
<li>Go&rsquo;s simplicity and lack of some features, like inheritance and function overloads, also contribute to its high compilation speed.</li>
</ol>
</div>
</div>
