blog/posts/Things-I-Like-about-GO-Language.org
* Command-line Utilities
Go comes with great command line tools that make it easy to perform operations, such as building the source code, much easier than those in C++ and Java. For example, Go standardizes source code formatting through ~go fmt~ command, which is important in collaboration projects. Below is a list of commonly used commands; for the complete list of commands and their options, consult [[https://golang.org/cmd/go/][Command Go]].
+ ~go help~ provides help regarding Go commands.
+ ~go fmt~ formats package sources. Most well-known editors and IDEs, including Vim, Emacs, Eclipse, Sublime, and Intellij, have plugins to format source codes as you develop.
+ ~go get~ downloads and installs packages and dependencies.
+ ~go build~ compiles packages and dependencies into binary files and places them in the current folder.
+ ~go install~ compiles package and dependencies into binary file and places them in the directory specified by GOPATH environment variable. Executables are placed in the ~bin/~ folder while compiled package objects are put in the ~pkg/~ folder.
+ ~go run~ compiles a source code into a temporary executable and runs it.
+ ~go test~ runs test codes using Go's built-in testing framework. Test functions start with ~Test~ as follows:
            #+begin_src go
            func TestMyFunc(t *testing.T) {
                // implement test logic for MyFunc()
            }
            #+end_src
+ ~go env~ prints Go's environments variables, including GOPATH and GOROOT.
+ ~go version~ prints Go version.

* Access Level
In C++, access levels of fields and methods of a class can be public, private, or protected. Java adds one more access level beside them: package private. In Go, there are only private and public access levels.

C++ originally had private and public access levels. Mark Linton, the main architect of the InterViews library, campaigned for the addition of the protected access level. Few years later, he banned using it in the library as it was one of the main sources of many bugs; see [[http://www.stroustrup.com/dne.html][The Design and Evolution of C++]], by Bjarne Stroustrup.

Go's simplistic design restricts access levels to private and public with a simple rule: fields and methods starting with capital letters are public; otherwise private.

* Data Types
Beside having basic types, booleans, numbers, and strings, Go has composite data types array, slices, structs, and maps. Functions are also first-class data types in Go.

** Array and Slices
Arrays and slices are sequences of homogeneous basic types. An Array has fixed size and its size is known at compile time. However, a slice is dynamically sized and its size can change at runtime. Using slices in Go is as easy as using lists in Python, which differentiates it from similar compiled languages like C++ and Java. In particular, for a given slice or even an array ~s~, we can construct the following slices:
+ ~s[i:j]~, representing a slice with elements ~s[i],..., s[j-1]~
+ ~s[:j]~ is equivalent to ~s[0:j]~
+ ~s[i:]~ is equivalent to ~s[i:len(s)]~
+ ~s[:]~ is equivalent to ~s[0:len(s)]~
The latter is particularly useful in converting an array to a slice. Built-in function ~append~ is used to append one or more element as well as another slice, as depicted in the following code snippet:
#+begin_src go
a := []int{2,4}
b := make([]int, 3)
var s []int
s = append(s, 3)
s = append(s, 2, 6, 7)
s = append(s, a...)
s = append(s, b...)
// s is [3,2,6,7,2,4]
#+end_src
Note three different ways of declaring slices: ~a~ is declared and initialized using slice literals; ~b~ is declared as a slice with length 3 using built-in ~make~ function; ~s~ is just declared without initialization. Function ~make~ accepts an optional thrid arguments as the capacity of the slice.
** Maps
Maps are references to hash tables, which are one of the most important data structures. Unlike slices, maps have to be initialized first, before they are used. As shown in the following code snippet, the first two methods work, while the last one results in panic.
#+begin_src go
height := make(map[string]float32)
height["Mike"] = 180.35 // cm
height["Sarah"] = 167.42

height := map[string]int {
    "Mike": 180.35,
    "Sarah": 167.42, // comma is required
}

var height map[string]int
height["Mike"] = 180.35 // oops! panic: height not initialized!
#+end_src
The idiomatic approach to check if a key exists in a map is as follows:
#+begin_src go
if h, ok := height["Mike"]; !ok {
   // height of Mike not available
} else {
   // use h as height og Mike
}
#+end_src
To iterate over all the key-values of a map, we can use built-in ~range~ function as follows:
#+begin_src go
for key, value := range height {
   // use key and value
}
#+end_src

