blog/posts/Things-I-Like-about-GO-Language.html

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Command-line Utilities</h2>
<div class="outline-text-2" id="text-orgheadline7">
<p>
Go comes with great command line tools that make it easy to perform operations, such as building the source code, much easier than those in C++ and Java. For example, Go standardizes source code formatting through <code>go fmt</code> command, which is important in collaboration projects. Below is a list of commonly used commands; for the complete list of commands and their options, consult <a href="https://golang.org/cmd/go/">Command Go</a>.
</p>
<ul class="org-ul">
<li><code>go help</code> provides help regarding Go commands.</li>
<li><code>go fmt</code> formats package sources. Most well-known editors and IDEs, including Vim, Emacs, Eclipse, Sublime, and Intellij, have plugins to format source codes as you develop.</li>
<li><code>go get</code> downloads and installs packages and dependencies.</li>
<li><code>go build</code> compiles packages and dependencies into binary files and places them in the current folder.</li>
<li><code>go install</code> compiles package and dependencies into binary file and places them in the directory specified by GOPATH environment variable. Executables are placed in the <code>bin/</code> folder while compiled package objects are put in the <code>pkg/</code> folder.</li>
<li><code>go run</code> compiles a source code into a temporary executable and runs it.</li>
<li><p>
<code>go test</code> runs test codes using Go&rsquo;s built-in testing framework. Test functions start with <code>Test</code> as follows:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">TestMyFunc</span>(t *<span style="color: #ffff00; font-size: 105%;">testing.T</span>) {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">implement test logic for MyFunc()</span>
}
</pre>
</div></li>
<li><code>go env</code> prints Go&rsquo;s environments variables, including GOPATH and GOROOT.</li>
<li><code>go version</code> prints Go version.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">Access Level</h2>
<div class="outline-text-2" id="text-orgheadline8">
<p>
In C++, access levels of fields and methods of a class can be public, private, or protected. Java adds one more access level beside them: package private. In Go, there are only private and public access levels.
</p>

<p>
C++ originally had private and public access levels. Mark Linton, the main architect of the InterViews library, campaigned for the addition of the protected access level. Few years later, he banned using it in the library as it was one of the main sources of many bugs; see <a href="http://www.stroustrup.com/dne.html">The Design and Evolution of C++</a>, by Bjarne Stroustrup.
</p>

<p>
Go&rsquo;s simplistic design restricts access levels to private and public with a simple rule: fields and methods starting with capital letters are public; otherwise private.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">Data Types</h2>
<div class="outline-text-2" id="text-orgheadline9">
<p>
Beside having basic types, booleans, numbers, and strings, Go has composite data types array, slices, structs, and maps. Functions are also first-class data types in Go.
</p>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">Array and Slices</h3>
<div class="outline-text-3" id="text-orgheadline10">
<p>
Arrays and slices are sequences of homogeneous basic types. An Array has fixed size and its size is known at compile time. However, a slice is dynamically sized and its size can change at runtime. Using slices in Go is as easy as using lists in Python, which differentiates it from similar compiled languages like C++ and Java. In particular, for a given slice or even an array <code>s</code>, we can construct the following slices:
</p>
<ul class="org-ul">
<li><code>s[i:j]</code>, representing a slice with elements <code>s[i],..., s[j-1]</code></li>
<li><code>s[:j]</code> is equivalent to <code>s[0:j]</code></li>
<li><code>s[i:]</code> is equivalent to <code>s[i:len(s)]</code></li>
<li><code>s[:]</code> is equivalent to <code>s[0:len(s)]</code></li>
</ul>
<p>
The latter is particularly useful in converting an array to a slice. Built-in function <code>append</code> is used to append one or more element as well as another slice, as depicted in the following code snippet:
</p>
<div class="org-src-container">

<pre class="src src-go">a := []<span style="color: #ffff00; font-size: 105%;">int</span>{2,4}
b := <span style="color: #87cefa; text-decoration: underline;">make</span>([]<span style="color: #ffff00; font-size: 105%;">int</span>, 3)
<span style="color: #ffb6c1; font-size: 105%;">var</span> s []<span style="color: #ffff00; font-size: 105%;">int</span>
s = <span style="color: #87cefa; text-decoration: underline;">append</span>(s, 3)
s = <span style="color: #87cefa; text-decoration: underline;">append</span>(s, 2, 6, 7)
s = <span style="color: #87cefa; text-decoration: underline;">append</span>(s, a...)
s = <span style="color: #87cefa; text-decoration: underline;">append</span>(s, b...)
<span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">s is [3,2,6,7,2,4]</span>
</pre>
</div>
<p>
Note three different ways of declaring slices: <code>a</code> is declared and initialized using slice literals; <code>b</code> is declared as a slice with length 3 using built-in <code>make</code> function; <code>s</code> is just declared without initialization. Function <code>make</code> accepts an optional thrid arguments as the capacity of the slice.
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">Maps</h3>
<div class="outline-text-3" id="text-orgheadline11">
<p>
Maps are references to hash tables, which are one of the most important data structures. Unlike slices, maps have to be initialized first, before they are used. As shown in the following code snippet, the first two methods work, while the last one results in panic.
</p>
<div class="org-src-container">

<pre class="src src-go">height := <span style="color: #87cefa; text-decoration: underline;">make</span>(<span style="color: #ffb6c1; font-size: 105%;">map</span>[<span style="color: #ffff00; font-size: 105%;">string</span>]<span style="color: #ffff00; font-size: 105%;">float32</span>)
height[<span style="color: #ffa07a;">"Mike"</span>] = 180.35 <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">cm</span>
height[<span style="color: #ffa07a;">"Sarah"</span>] = 167.42

height := <span style="color: #ffb6c1; font-size: 105%;">map</span>[<span style="color: #ffff00; font-size: 105%;">string</span>]<span style="color: #ffff00; font-size: 105%;">int</span> {
    <span style="color: #ffa07a;">"Mike"</span>: 180.35,
    <span style="color: #ffa07a;">"Sarah"</span>: 167.42, <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">comma is required</span>
}

<span style="color: #ffb6c1; font-size: 105%;">var</span> height <span style="color: #ffb6c1; font-size: 105%;">map</span>[<span style="color: #ffff00; font-size: 105%;">string</span>]<span style="color: #ffff00; font-size: 105%;">int</span>
height[<span style="color: #ffa07a;">"Mike"</span>] = 180.35 <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">oops! panic: height not initialized!</span>
</pre>
</div>
<p>
The idiomatic approach to check if a key exists in a map is as follows:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">if</span> h, ok := height[<span style="color: #ffa07a;">"Mike"</span>]; !ok {
   <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">height of Mike not available</span>
} <span style="color: #ffb6c1; font-size: 105%;">else</span> {
   <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">use h as height og Mike</span>
}
</pre>
</div>
<p>
To iterate over all the key-values of a map, we can use built-in <code>range</code> function as follows:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">for</span> key, value := <span style="color: #ffb6c1; font-size: 105%;">range</span> height {
   <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">use key and value</span>
}
</pre>
</div>
</div>
</div>
</div>
