blog/posts/Things-I-Like-about-GO-Language.org
* Pointers and references
Analogous to C and C++, Go has pointers and references too. Using pointers and references in C can be pretty daunting for many developers. However, due largely to the garbage collector, the use of pointers and references in Go is straightforward, since one does not need to worry about manual memory management and memory leaks. In C++, smart pointers are designed to facilitate memory management.

Similar to C/C++, objects in Go may be passed by value or by reference as function parameters. There is no definite rule on when to pass objects by value or by reference, however, the following guideline may help in making such a decision:
+ Objects tended to be modified by the function must be passed by reference.
+ Objects tended not to be modified must be passed by value.
+ Large objects are often passed by reference for efficiency, while small objects are passed by value. There is one subtlty here. A strcut holding a pointer to a large data structure is still a small object. Consider the following example:
  #+begin_src go
  type largeData struct {
      // lots of fields
  }
  type smallObject struct {
      ld *largeData
  }

  func processData(ld *largeData, so smallObject) {
      // use ld and so objects
  }
  #+end_src
  To avoid costly copy of large data, we pass ~ld~ by reference, while it is perfectly fine to pass ~so~ by value.

  Note that maps and slices in Go are data types holding pointers to actual data structures -- similar to ~smallObject~. Thus, it is efficient to pass them by value, regardless of how much data they hold.

Unlike C/C++, the address of a local variable can be returned by a function prolonging the lifetime of the variable beyond its inital scope. The following approach is quite common in Go:
#+begin_src go
type Person struct {
    name string
    height float32
}

func CreatePerson(name string, height float32) *Perosn {
    return &Person {
               name: name,
               height: height,
            }
}
#+end_src
There is yet another way to declare a pointer type using ~new~ function, as shown below:
#+begin_src go
func CreatePerson(name string, height float32) *Perosn {
    person := new(Person)
    person.name = name
    person.height = height
    return person
}
#+end_src
Note that ~new~ function return the address to an instance of ~Person~ which is of type pointer. In C/C++ address of a value -- not variable -- does not have any meaning. Go, however, creates a variable, initializes it, prolongs its lifetime, and return the address of the variable.

One subtle difference of the references in C/C++ and Go is that there is no reference /type/ in Go. Reference types in C/C++ can be used to define an alias for a variable. The following code illustrates this point:
#+begin_src cpp
int a = 1;
int &b = a; // b is alias to a
// value of both a and b is 1
a = 2;
// value of both a and b is 2
#+end_src

# + When the receiver should be value type when pointer type?

