blog/posts/Things-I-Like-about-GO-Language.html

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Pointers and references</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
Analogous to C and C++, Go has pointers and references too. Using pointers and references in C can be pretty daunting for many developers. However, due largely to the garbage collector, the use of pointers and references in Go is straightforward, since one does not need to worry about manual memory management and memory leaks. In C++, smart pointers are designed to facilitate memory management.
</p>

<p>
Similar to C/C++, objects in Go may be passed by value or by reference as function parameters. There is no definite rule on when to pass objects by value or by reference, however, the following guideline may help in making such a decision:
</p>
<ul class="org-ul">
<li>Objects tended to be modified by the function must be passed by reference.</li>
<li>Objects tended not to be modified must be passed by value.</li>
<li><p>
Large objects are often passed by reference for efficiency, while small objects are passed by value. There is one subtlty here. A strcut holding a pointer to a large data structure is still a small object. Consider the following example:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">type</span> <span style="color: #ffff00; font-size: 105%;">largeData</span> <span style="color: #ffb6c1; font-size: 105%;">struct</span> {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">lots of fields</span>
}
<span style="color: #ffb6c1; font-size: 105%;">type</span> <span style="color: #ffff00; font-size: 105%;">smallObject</span> <span style="color: #ffb6c1; font-size: 105%;">struct</span> {
    ld *largeData
}

<span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">processData</span>(ld *<span style="color: #ffff00; font-size: 105%;">largeData</span>, so <span style="color: #ffff00; font-size: 105%;">smallObject</span>) {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">use ld and so objects</span>
}
</pre>
</div>
<p>
To avoid costly copy of large data, we pass <code>ld</code> by reference, while it is perfectly fine to pass <code>so</code> by value.
</p>

<p>
Note that maps and slices in Go are data types holding pointers to actual data structures &#x2013; similar to <code>smallObject</code>. Thus, it is efficient to pass them by value, regardless of how much data they hold.
</p></li>
</ul>

<p>
Unlike C/C++, the address of a local variable can be returned by a function prolonging the lifetime of the variable beyond its inital scope. The following approach is quite common in Go:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">type</span> <span style="color: #ffff00; font-size: 105%;">Person</span> <span style="color: #ffb6c1; font-size: 105%;">struct</span> {
    name string
    height float32
}

<span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">CreatePerson</span>(name <span style="color: #ffff00; font-size: 105%;">string</span>, height <span style="color: #ffff00; font-size: 105%;">float32</span>) *<span style="color: #ffff00; font-size: 105%;">Perosn</span> {
    <span style="color: #ffb6c1; font-size: 105%;">return</span> &amp;Person {
               <span style="color: #7fffd4;">name</span>: name,
               <span style="color: #7fffd4;">height</span>: height,
            }
}
</pre>
</div>
<p>
There is yet another way to declare a pointer type using <code>new</code> function, as shown below:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">CreatePerson</span>(name <span style="color: #ffff00; font-size: 105%;">string</span>, height <span style="color: #ffff00; font-size: 105%;">float32</span>) *<span style="color: #ffff00; font-size: 105%;">Perosn</span> {
    person := <span style="color: #87cefa; text-decoration: underline;">new</span>(<span style="color: #ffff00; font-size: 105%;">Person</span>)
    person.name = name
    person.height = height
    <span style="color: #ffb6c1; font-size: 105%;">return</span> person
}
</pre>
</div>
<p>
Note that <code>new</code> function return the address to an instance of <code>Person</code> which is of type pointer. In C/C++ address of a value &#x2013; not variable &#x2013; does not have any meaning. Go, however, creates a variable, initializes it, prolongs its lifetime, and return the address of the variable.
</p>

<p>
One subtle difference of the references in C/C++ and Go is that there is no reference <i>type</i> in Go. Reference types in C/C++ can be used to define an alias for a variable. The following code illustrates this point:
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">a</span> = 1;
<span style="color: #ffff00; font-size: 105%;">int</span> &amp;<span style="color: #ffd700;">b</span> = a; <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">b is alias to a</span>
<span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">value of both a and b is 1</span>
a = 2;
<span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">value of both a and b is 2</span>
</pre>
</div>
</div>
</div>
