blog/posts/Things-I-Like-about-GO-Language.org
* Type Inference
In dynamically-typed languages, like Python, a variable can be initialized without specifying its type: ~a = 10~. In statically-typed languages, like Java and C++, however, the type of a variable must be specified when declared: ~int a = 10~.

Variable declaration is simplified in later versions of C++, thus one can write ~auto a = 10~ and the type of ~a~ (~int~) is inferred from the right-hand-side value. This is particularly useful when you have template (generic) types or defining lambda functions. For example, compare the following two equivalent lambda function declarations:
#+begin_src cpp
function<int(int, int)> sum = [](int a, int b) { return a + b; };
auto sum = [](int a, int b) { return a + b; }; // more concise
#+end_src
The second declaration is concise and more readable, while the first one has to specify unnecessary and redundant details of the function input and output types.

In Java, types must be declared in full. This can be annoying particularly in ~for~ loops:
#+begin_src java
for(Map.Entry<String, String> item : items.entrySet()) {
    // do something on item
}
#+end_src
Java 10 introduces ~var~ keyword for type inference, similar to ~auto~ in C++. Thus, in Java 10, the latter code snippet can be simplified to:
#+begin_src java
for(var item : items.entrySet()) {
    // do something on item
}
#+end_src

In Go, a variable can be declared and initialized in a concise form as ~a := 10~, referred to as the /short variable declaration/. Short variable declarations are particularly useful in ~for~ loops or even ~if~ statements, a distinguishing feature of Go which will be discussed later. A typical Go code may include the following statements:
#+begin_src go
for i, item := range items {
    // do something on index i and value item
}
if val, err := getValue(); err != nil {
    // report error; disregard val
} else {
    // do something with val
}
#+end_src
Note that the types are inferred and not specified explicitly, resulting in clean and readable code.

A few more notes are in order. The parentheses around the ~if~ and ~for~ statements /can/ be omitted. A local variable, such as ~val~ and ~err~, can be declared in the ~if~ statement before checking the condition; this will be discussed in more details later. The key word ~range~ is used in the ~for~ loop to ease iterating over the items of a list. This is similar to ~enumerate~ in Python. Other typical ways for iterating over lists include
#+begin_src go
for i := range items {
    // do something on index i
    // items[i] can still be used to access items
}
for _, item := range items {
    // ignore index i and use item
}
#+end_src

* Multiple Return Values and Blank Identifiers
Functions in Go can return multiple values, any of which may be ignored using the /blank identifier/, denoted by underscroe. Its syntax is similar to that of high-level languages, like Python. In Java or C++, a new object holding multiple fields should be defined to fulfill such a task. In recent versions of C++, a tuple (~std::tuple~) gluing multiple variables together can be a return type of a function. Some of the outputs may be ignored using ~std::ignore~. The usage in Go is, however, significanly more convenient. The following function illustrates returning both minimum and maximum of a slice:
#+begin_src go
func MinMax(arr []int) (int, int, error) {
    if len(arr) == 0 {
       return 0, 0, fmt.Errorf("Input slice is empty")
    }
    min, max := arr[0], arr[0]
    for _, a := range arr {
        if a < min {
            min = a
        } else if a > max {
            max = a
        }
    }
    return min, max, nil
}
#+end_src
It's idiomatic in Go to return error as the last return value. To ignore the maximum value, for example, we can write:
#+begin_src go
min, _, err := MinMax(arr)
#+end_src
In Go, return values can be named. Named return variables are initialized to their default values, thus, there is no need to specify defaults values, 0 for ~int~ type and ~nil~ for ~error~ type. This is illustrated in the following code snippet:
#+begin_src go
func MinMax(arr []int) (min, max int, err error) {
    if len(arr) == 0 {
       err = fmt.Errorf("Input slice is empty")
       return
    }
    min, max = arr[0], arr[0]
    for _, a := range arr {
        if a < min {
            min = a
        } else if a > max {
            max = a
        }
    }
    return
}
#+end_src

* Main topics
** Interface system
** Variadic
** Error handling
Passing error vs exception handling (this is like goto)
** Any comparison between async callbacks and sync goroutines/channels?
Check if Go is used for async programming. If so, compare it with Javascript or Vertx framework in Java.
