blog/posts/Things-I-Like-about-GO-Language.html


<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Type Inference</h2>
<div class="outline-text-2" id="text-orgheadline13">
<p>
In dynamically-typed languages, like Python, a variable can be initialized without specifying its type: <code>a = 10</code>. In statically-typed languages, like Java and C++, however, the type of a variable must be specified when declared: <code>int a = 10</code>.
</p>

<p>
Variable declaration is simplified in later versions of C++, thus one can write <code>auto a = 10</code> and the type of <code>a</code> (<code>int</code>) is inferred from the right-hand-side value. This is particularly useful when you have template (generic) types or defining lambda functions. For example, compare the following two equivalent lambda function declarations:
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #ffff00; font-size: 105%;">function</span>&lt;<span style="color: #ffff00; font-size: 105%;">int</span>(<span style="color: #ffff00; font-size: 105%;">int</span>, <span style="color: #ffff00; font-size: 105%;">int</span>)&gt; <span style="color: #ffd700;">sum</span> = [](<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">a</span>, <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">b</span>) { <span style="color: #ffb6c1; font-size: 105%;">return</span> a + b; };
<span style="color: #ffb6c1; font-size: 105%;">auto</span> <span style="color: #ffff00; font-size: 105%;">sum</span> = [](<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">a</span>, <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">b</span>) { <span style="color: #ffb6c1; font-size: 105%;">return</span> a + b; }; <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">more concise</span>
</pre>
</div>
<p>
The second declaration is concise and more readable, while the first one has to specify unnecessary and redundant details of the function input and output types.
</p>

<p>
In Java, types must be declared in full. This can be annoying particularly in <code>for</code> loops:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ffb6c1; font-size: 105%;">for</span>(<span style="color: #7fffd4;">Map</span>.<span style="color: #ffff00; font-size: 105%;">Entry</span>&lt;<span style="color: #ffff00; font-size: 105%;">String</span>, <span style="color: #ffff00; font-size: 105%;">String</span>&gt; item : items.entrySet()) {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">do something on item</span>
}
</pre>
</div>
<p>
Java 10 introduces <code>var</code> keyword for type inference, similar to <code>auto</code> in C++. Thus, in Java 10, the latter code snippet can be simplified to:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ffb6c1; font-size: 105%;">for</span>(<span style="color: #ffff00; font-size: 105%;">var</span> <span style="color: #ffd700;">item</span> : items.entrySet()) {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">do something on item</span>
}
</pre>
</div>

<p>
In Go, a variable can be declared and initialized in a concise form as <code>a := 10</code>, referred to as the <i>short variable declaration</i>. Short variable declarations are particularly useful in <code>for</code> loops or even <code>if</code> statements, a distinguishing feature of Go which will be discussed later. A typical Go code may include the following statements:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">for</span> i, item := <span style="color: #ffb6c1; font-size: 105%;">range</span> items {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">do something on index i and value item</span>
}
<span style="color: #ffb6c1; font-size: 105%;">if</span> val, err := <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">getValue</span>(); err != <span style="color: #7fffd4;">nil</span> {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">report error; disregard val</span>
} <span style="color: #ffb6c1; font-size: 105%;">else</span> {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">do something with val</span>
}
</pre>
</div>
<p>
Note that the types are inferred and not specified explicitly, resulting in clean and readable code.
</p>

<p>
A few more notes are in order. The parentheses around the <code>if</code> and <code>for</code> statements <i>can</i> be omitted. A local variable, such as <code>val</code> and <code>err</code>, can be declared in the <code>if</code> statement before checking the condition; this will be discussed in more details later. The key word <code>range</code> is used in the <code>for</code> loop to ease iterating over the items of a list. This is similar to <code>enumerate</code> in Python. Other typical ways for iterating over lists include
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">for</span> i := <span style="color: #ffb6c1; font-size: 105%;">range</span> items {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">do something on index i</span>
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">items[i] can still be used to access items</span>
}
<span style="color: #ffb6c1; font-size: 105%;">for</span> _, item := <span style="color: #ffb6c1; font-size: 105%;">range</span> items {
    <span style="color: #90ee90; font-style: italic;">// </span><span style="color: #90ee90; font-style: italic;">ignore index i and use item</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14">Multiple Return Values and Blank Identifiers</h2>
<div class="outline-text-2" id="text-orgheadline14">
<p>
Functions in Go can return multiple values, any of which may be ignored using the <i>blank identifier</i>, denoted by underscroe. Its syntax is similar to that of high-level languages, like Python. In Java or C++, a new object holding multiple fields should be defined to fulfill such a task. In recent versions of C++, a tuple (<code>std::tuple</code>) gluing multiple variables together can be a return type of a function. Some of the outputs may be ignored using <code>std::ignore</code>. The usage in Go is, however, significanly more convenient. The following function illustrates returning both minimum and maximum of a slice:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">MinMax</span>(arr []<span style="color: #ffff00; font-size: 105%;">int</span>) (<span style="color: #ffff00; font-size: 105%;">int</span>, <span style="color: #ffff00; font-size: 105%;">int</span>, <span style="color: #ffff00; font-size: 105%;">error</span>) {
    <span style="color: #ffb6c1; font-size: 105%;">if</span> <span style="color: #87cefa; text-decoration: underline;">len</span>(arr) == 0 {
       <span style="color: #ffb6c1; font-size: 105%;">return</span> 0, 0, fmt.<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Errorf</span>(<span style="color: #ffa07a;">"Input slice is empty"</span>)
    }
    min, max := arr[0], arr[0]
    <span style="color: #ffb6c1; font-size: 105%;">for</span> _, a := <span style="color: #ffb6c1; font-size: 105%;">range</span> arr {
        <span style="color: #ffb6c1; font-size: 105%;">if</span> a &lt; min {
            min = a
        } <span style="color: #ffb6c1; font-size: 105%;">else</span> <span style="color: #ffb6c1; font-size: 105%;">if</span> a &gt; max {
            max = a
        }
    }
    <span style="color: #ffb6c1; font-size: 105%;">return</span> min, max, <span style="color: #7fffd4;">nil</span>
}
</pre>
</div>
<p>
It&rsquo;s idiomatic in Go to return error as the last return value. To ignore the maximum value, for example, we can write:
</p>
<div class="org-src-container">

<pre class="src src-go">min, _, err := <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">MinMax</span>(arr)
</pre>
</div>
<p>
In Go, return values can be named. Named return variables are initialized to their default values, thus, there is no need to specify defaults values, 0 for <code>int</code> type and <code>nil</code> for <code>error</code> type. This is illustrated in the following code snippet:
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffb6c1; font-size: 105%;">func</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">MinMax</span>(arr []<span style="color: #ffff00; font-size: 105%;">int</span>) (min, max <span style="color: #ffff00; font-size: 105%;">int</span>, err <span style="color: #ffff00; font-size: 105%;">error</span>) {
    <span style="color: #ffb6c1; font-size: 105%;">if</span> <span style="color: #87cefa; text-decoration: underline;">len</span>(arr) == 0 {
       err = fmt.<span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Errorf</span>(<span style="color: #ffa07a;">"Input slice is empty"</span>)
       <span style="color: #ffb6c1; font-size: 105%;">return</span>
    }
    min, max = arr[0], arr[0]
    <span style="color: #ffb6c1; font-size: 105%;">for</span> _, a := <span style="color: #ffb6c1; font-size: 105%;">range</span> arr {
        <span style="color: #ffb6c1; font-size: 105%;">if</span> a &lt; min {
            min = a
        } <span style="color: #ffb6c1; font-size: 105%;">else</span> <span style="color: #ffb6c1; font-size: 105%;">if</span> a &gt; max {
            max = a
        }
    }
    <span style="color: #ffb6c1; font-size: 105%;">return</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22">Main topics</h2>
<div class="outline-text-2" id="text-orgheadline22">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">Interface system</h3>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">Variadic</h3>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">Error handling</h3>
<div class="outline-text-3" id="text-orgheadline17">
<p>
Passing error vs exception handling (this is like goto)
</p>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">Any comparison between async callbacks and sync goroutines/channels?</h3>
<div class="outline-text-3" id="text-orgheadline18">
<p>
Check if Go is used for async programming. If so, compare it with Javascript or Vertx framework in Java.
</p>
</div>
</div>
