blog/posts/Things-I-Like-about-GO-Language.org
** defer statement
** enumerations vs constants with iota
** Criticisms

* Summary and Conclusion
As a summary, Go is a modern language that delibrately omits some well-known features in similar languages to achieve high performance... It's widely used in many productions, including Kubernetes, Docker, Dropbox, Heroku, Hyperledger Fabric, CoreOS, InfluxDB, etc.

** Features from dynamic languages:
1. Short variable declaration and initialization through type inference
2. Multiple return values and blanck identifiers
3. An interface system in place of virtual inheritance, and type embedding instead of non-virtual inheritance.
4. Maps and slices as well as first class functions

* Links:
+ https://medium.com/exploring-code/why-should-you-learn-go-f607681fad65
+ https://www.quora.com/What-reasons-are-there-to-not-use-Go-programming-language
+ [[https://github.com/golang/go/issues/22013][proposal: Go 2: remove embedded struct #22013]]
+ [[https://bluxte.net/musings/2018/04/10/go-good-bad-ugly/#a-few-days-later-3-on-hacker-news][Go: the Good, the Bad and the Ugly]]
+ [[https://notes.shichao.io/gopl/ch8/][Chapter 8. Goroutines and Channels]]
+ [[https://dominik.honnef.co/posts/2014/12/an_incomplete_list_of_go_tools/][An incomplete list of Go tools]]

