blog/posts/Things-I-Like-about-GO-Language.html
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">defer statement</h3>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">enumerations vs constants with iota</h3>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">Criticisms</h3>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23">Summary and Conclusion</h2>
<div class="outline-text-2" id="text-orgheadline23">
<p>
As a summary, Go is a modern language that delibrately omits some well-known features in similar languages to achieve high performance&#x2026; It&rsquo;s widely used in many productions, including Kubernetes, Docker, Dropbox, Heroku, Hyperledger Fabric, CoreOS, InfluxDB, etc.
</p>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24">Features from dynamic languages:</h3>
<div class="outline-text-3" id="text-orgheadline24">
<ol class="org-ol">
<li>Short variable declaration and initialization through type inference</li>
<li>Multiple return values and blanck identifiers</li>
<li>An interface system in place of virtual inheritance, and type embedding instead of non-virtual inheritance.</li>
<li>Maps and slices as well as first class functions</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25">Links:</h2>
<div class="outline-text-2" id="text-orgheadline25">
<ul class="org-ul">
<li><a href="https://medium.com/exploring-code/why-should-you-learn-go-f607681fad65">https://medium.com/exploring-code/why-should-you-learn-go-f607681fad65</a></li>
<li><a href="https://www.quora.com/What-reasons-are-there-to-not-use-Go-programming-language">https://www.quora.com/What-reasons-are-there-to-not-use-Go-programming-language</a></li>
<li><a href="https://github.com/golang/go/issues/22013">proposal: Go 2: remove embedded struct #22013</a></li>
<li><a href="https://bluxte.net/musings/2018/04/10/go-good-bad-ugly/#a-few-days-later-3-on-hacker-news">Go: the Good, the Bad and the Ugly</a></li>
<li><a href="https://notes.shichao.io/gopl/ch8/">Chapter 8. Goroutines and Channels</a></li>
<li><a href="https://dominik.honnef.co/posts/2014/12/an_incomplete_list_of_go_tools/">An incomplete list of Go tools</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-06-29</p>
<p class="author">Author: Eissa Nematollahi</p>
<p class="date">Created: 2018-07-02 Mon 03:22</p>
<p class="validation"></p>
</div>
</body>
</html>
